Done! Model Saved!
dict_keys(['val_loss', 'loss'])
Loss
[0.011266195079769102, 0.007800295618224362, 0.00714909128077548]
Validation Loss
[0.018688283652591262, 0.021710494053512323, 0.02167534684976077]
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
lambda_1 (Lambda)            (None, 160, 320, 3)       0         
_________________________________________________________________
cropping2d_1 (Cropping2D)    (None, 90, 320, 3)        0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 45, 160, 24)       1824      
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 23, 80, 36)        21636     
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 12, 40, 48)        43248     
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 6, 20, 64)         27712     
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 3, 10, 64)         36928     
_________________________________________________________________
flatten_1 (Flatten)          (None, 1920)              0         
_________________________________________________________________
dense_1 (Dense)              (None, 100)               192100    
_________________________________________________________________
dense_2 (Dense)              (None, 50)                5050      
_________________________________________________________________
dense_3 (Dense)              (None, 10)                510       
_________________________________________________________________
dense_4 (Dense)              (None, 1)                 11        
=================================================================
Total params: 329,019
Trainable params: 329,019
Non-trainable params: 0
_________________________________________________________________
